weblog/app/controllers/posts_controller.rb

def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 16 Aug 2013 22:54:23 UTC +00:00], ["text", "first post text"], ["title", "first post"], ["updated_at", Fri, 16 Aug 2013 22:54:23 UTC +00:00]]

def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 8  [["text", "asdfasdfasdf  sdf"], ["updated_at", Tue, 20 Aug 2013 02:02:55 UTC +00:00]]